Revit 2027 API
StairsRun.GetAllSupports Method
 Retrieves all supports hosted by the stair's run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetAllSupports()
Public Function GetAllSupports As IList(Of ElementId)
public:
IList<ElementId^>^ GetAllSupports()
member GetAllSupports : unit -> IList<ElementId>
Return Value
IList<ElementId>
 All supports hosted by the stair's run.
Remarks
 The supports consist of left, right, and middle supports of the stair's run.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace